## Lists

In [128]:
marks = [23, 15, 25, 13]
marks

[23, 15, 25, 13]

In [129]:
marks[0]

23

In [130]:
marks[1]

15

In [131]:
marks[-1]

13

In [132]:
marks[-2]

25

In [133]:
marks.append(17)
marks

[23, 15, 25, 13, 17]

In [134]:
marks.insert(0, 20)
marks

[20, 23, 15, 25, 13, 17]

In [135]:
marks.extend([15, 22, 9])
marks

[20, 23, 15, 25, 13, 17, 15, 22, 9]

In [136]:
# marks.remove(15)
# marks

In [137]:
# marks.pop(3)
# marks

In [138]:
marks.append(15)
marks

[20, 23, 15, 25, 13, 17, 15, 22, 9, 15]

In [139]:
# for i in range(3):
#     marks.remove(15)

# marks

In [140]:
15 in marks

True

In [141]:
33 in marks

False

In [142]:
# while 15 in marks:
#     marks.remove(15)
    
# marks

In [143]:
marks.index(13)

4

In [144]:
len(marks)

10

In [145]:
max(marks)

25

In [146]:
sum(marks) / len(marks)

17.4

In [147]:
marks.sort()
marks

[9, 13, 15, 15, 15, 17, 20, 22, 23, 25]

In [148]:
marks[0:3]

[9, 13, 15]

In [149]:
marks[:3]

[9, 13, 15]

In [150]:
marks[-3:]

[22, 23, 25]

---
## Tuples
> Immutable

In [151]:
days = ("Sun", "Mon", "Tue", "Wed", "Thu", "Fri")
days

('Sun', 'Mon', 'Tue', 'Wed', 'Thu', 'Fri')

In [152]:
days[0]

'Sun'

In [153]:
days[:3]

('Sun', 'Mon', 'Tue')

In [154]:
# days[0] = "Sunday"
# days

In [155]:
list(days)

['Sun', 'Mon', 'Tue', 'Wed', 'Thu', 'Fri']

---
## Dictionaries

In [156]:
# countries = ["Saudi Arabia", "Arab Emirates", "Egypt"]
countries = {
    "sa": "Saudi Arabia",
    "ae": "Arab Emirates",
    "eg": "Egypt"
}
countries

{'sa': 'Saudi Arabia', 'ae': 'Arab Emirates', 'eg': 'Egypt'}

In [157]:
countries["ae"]

'Arab Emirates'

In [158]:
countries["pl"] = "Palstine"
countries

{'sa': 'Saudi Arabia', 'ae': 'Arab Emirates', 'eg': 'Egypt', 'pl': 'Palstine'}

In [159]:
countries.update({"ku": "Kuwait"})
countries

{'sa': 'Saudi Arabia',
 'ae': 'Arab Emirates',
 'eg': 'Egypt',
 'pl': 'Palstine',
 'ku': 'Kuwait'}

In [160]:
countries["eg"] = "Republic of Egypt"
countries

{'sa': 'Saudi Arabia',
 'ae': 'Arab Emirates',
 'eg': 'Republic of Egypt',
 'pl': 'Palstine',
 'ku': 'Kuwait'}

In [161]:
# countries.pop("ae")
# countries

In [162]:
# del countries["eg"]
# countries

In [163]:
# countries.popitem()
# countries

In [164]:
list(countries.values())

['Saudi Arabia', 'Arab Emirates', 'Republic of Egypt', 'Palstine', 'Kuwait']

In [165]:
list(countries.keys())

['sa', 'ae', 'eg', 'pl', 'ku']

In [166]:
list(countries.items())

[('sa', 'Saudi Arabia'),
 ('ae', 'Arab Emirates'),
 ('eg', 'Republic of Egypt'),
 ('pl', 'Palstine'),
 ('ku', 'Kuwait')]

In [167]:
students = {
    "Ahmed": [23, 15, 22],
    "Ali": [19, 28, 25],
    "Wael": [15, 30, 29]
}

students

{'Ahmed': [23, 15, 22], 'Ali': [19, 28, 25], 'Wael': [15, 30, 29]}

In [168]:
students["Ali"]

[19, 28, 25]

In [169]:
students["Ali"][1]

28

---
## Loops

In [170]:
for i in range(5):
    print(i)

0
1
2
3
4

In [171]:
list(range(1, 10, 2))

[1, 3, 5, 7, 9]

In [172]:
list(range(1, 10))

[1, 2, 3, 4, 5, 6, 7, 8, 9]

In [173]:
list(range(10))

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [174]:
list(range(5))

[0, 1, 2, 3, 4]

In [175]:
salaries = [15000, 5000, 7000, 13000]
for sal in salaries:
    print(sal)

15000
5000
7000
13000

In [176]:
for sal in salaries:
    print(sal + 500)

15500
5500
7500
13500

In [177]:
for k in countries:
    print(k)

sa
ae
eg
pl
ku

In [178]:
for k in countries.values():
    print(k)

Saudi Arabia
Arab Emirates
Republic of Egypt
Palstine
Kuwait

In [179]:
for k, v in countries.items():
    print(k, "=>", v)

sa => Saudi Arabia
ae => Arab Emirates
eg => Republic of Egypt
pl => Palstine
ku => Kuwait

In [180]:
for k in countries.items():
    print(k)

('sa', 'Saudi Arabia')
('ae', 'Arab Emirates')
('eg', 'Republic of Egypt')
('pl', 'Palstine')
('ku', 'Kuwait')

In [181]:
msg = "Welocme to Python"
for ch in msg:
    print(ch)

W
e
l
o
c
m
e

t
o

P
y
t
h
o
n

In [182]:
x = 1
while x <= 10:
    print(x, end="\t")
    x += 1

1	2	3	4	5	6	7	8	9	10

In [183]:
salaries = []
# data = input("Enter a salary (or stop): ")
# while data != "stop":
#     data = eval(data)
#     salaries.append(data)
#     data = input("Enter a salary (of stop): ")

salaries

[]

---
## Comprehenshion

In [184]:
salaries

[]

In [185]:
# new_salaries = []
# for sal in salaries:
#     new_salaries.append(sal + 500)

# new_salaries

In [186]:
salaries = [s+500 for s in salaries]
salaries

[]

In [187]:
temp1 = [s+500 for s in salaries if s < 10000]
temp1

[]

In [188]:
salaries

[]

In [189]:
temp2 = [s+500 if s < 10000 else s  for s in salaries]
temp2

[]

In [190]:
nums = [1, 2, 3]
nums2 = [n*2 for n in nums]
nums2

[2, 4, 6]

In [191]:
#0599888921

In [192]:
list(set(marks))

[9, 13, 15, 17, 20, 22, 23, 25]

In [193]:
lstA = [13,15,-4,8,23,25,17,44,-7,-10,0,1,5,0,2,8,45]
strings = ['SK1908','RK1905','SB1001','GM1406','EL3005']
cities_A = ['Tokyo','Shanghai','Jakarta','Delhi','Seoul']
populations_A = [37.8,34.9,31.7,26.5,25.5]

In [194]:
postcode = []
for code in strings:
    postcode.append(code[:2])

postcode

['SK', 'RK', 'SB', 'GM', 'EL']

In [195]:
postcodes = [code[:2] for code in strings]
postcodes

['SK', 'RK', 'SB', 'GM', 'EL']

In [196]:
[n for n in lstA if n >= 0]

[13, 15, 8, 23, 25, 17, 44, 0, 1, 5, 0, 2, 8, 45]

In [197]:
[n*10 for n in lstA if n >= 0]

[130, 150, 80, 230, 250, 170, 440, 0, 10, 50, 0, 20, 80, 450]

In [198]:
[n*10 if n >= 0 else abs(n)  for n in lstA ]

[130, 150, 4, 80, 230, 250, 170, 440, 7, 10, 0, 10, 50, 0, 20, 80, 450]

In [199]:
# {13: "Positive", 15: "Positive", -4: "Negative", }

{n: "Positive" if n >= 0 else "Negative"  for n in lstA}

{13: 'Positive',
 15: 'Positive',
 -4: 'Negative',
 8: 'Positive',
 23: 'Positive',
 25: 'Positive',
 17: 'Positive',
 44: 'Positive',
 -7: 'Negative',
 -10: 'Negative',
 0: 'Positive',
 1: 'Positive',
 5: 'Positive',
 2: 'Positive',
 45: 'Positive'}

In [200]:
{c: len(c) for c in cities_A}

{'Tokyo': 5, 'Shanghai': 8, 'Jakarta': 7, 'Delhi': 5, 'Seoul': 5}

In [201]:
{
    c: p
    for c, p in zip(cities_A, populations_A)
}

{'Tokyo': 37.8,
 'Shanghai': 34.9,
 'Jakarta': 31.7,
 'Delhi': 26.5,
 'Seoul': 25.5}

In [202]:
{
    i+1 : c
    for i, c in enumerate(cities_A)
}

{1: 'Tokyo', 2: 'Shanghai', 3: 'Jakarta', 4: 'Delhi', 5: 'Seoul'}

In [203]:

{
    c: (i+1, p)
    for i, (c, p) in enumerate(zip(cities_A, populations_A))
}

{'Tokyo': (1, 37.8),
 'Shanghai': (2, 34.9),
 'Jakarta': (3, 31.7),
 'Delhi': (4, 26.5),
 'Seoul': (5, 25.5)}

## Numpy

In [204]:
# pip install numpy
import numpy as np

marks = np.array([23, 19, 18, 21])
type(marks)

numpy.ndarray

In [205]:
# [n + 2 for n in marks]

marks + 2

array([25, 21, 20, 23])

In [206]:
marks / 25 * 100

array([92., 76., 72., 84.])

In [207]:
marks.dtype

dtype('int32')

In [208]:
pct = marks / 25 * 100
pct

array([92., 76., 72., 84.])

In [209]:
pct.dtype

dtype('float64')

In [210]:
lst = np.array(["Omar", 23, 25, 19])
lst

array(['Omar', '23', '25', '19'], dtype='<U11')

In [211]:
# lst * 3

In [212]:
marks.max()

23

In [213]:
marks.min()

18

In [214]:
marks.mean()

20.25

In [215]:
# marks.median()

In [216]:
np.median(marks)

20.0

In [217]:
np.mean(marks)

20.25

## Pandas
### Series

In [218]:
import pandas as pd

marks = pd.Series([23, 13, 21, 18, 19])
marks

0    23
1    13
2    21
3    18
4    19
dtype: int64

In [219]:
marks[0]

23

In [220]:
marks[0:3]

0    23
1    13
2    21
dtype: int64

In [221]:
marks + 2

0    25
1    15
2    23
3    20
4    21
dtype: int64

In [222]:
marks / 25 * 100

0    92.0
1    52.0
2    84.0
3    72.0
4    76.0
dtype: float64

In [223]:
marks = pd.Series([23, 13, 21, 18, 19], 
                  index=["Ahmed", "Mohamed", "Ali", "Wael", "Yasser"])
marks

Ahmed      23
Mohamed    13
Ali        21
Wael       18
Yasser     19
dtype: int64

In [224]:
marks["Ali"]

21

In [225]:

marks["Ahmed": "Ali"]

Ahmed      23
Mohamed    13
Ali        21
dtype: int64

In [226]:
marks.max()

23

In [227]:
marks.mean()

18.8

In [228]:
marks.median()

19.0

In [229]:

marks.mode()

0    13
1    18
2    19
3    21
4    23
dtype: int64

In [230]:
more_marks = pd.Series({"Omar": 23, "Belal": 18, "Khalid": 18, "Baraa": 23})
marks = marks.append(more_marks)
marks

Ahmed      23
Mohamed    13
Ali        21
Wael       18
Yasser     19
Omar       23
Belal      18
Khalid     18
Baraa      23
dtype: int64

In [231]:
marks.mode()

0    18
1    23
dtype: int64

In [232]:
marks.describe()

count     9.000000
mean     19.555556
std       3.320810
min      13.000000
25%      18.000000
50%      19.000000
75%      23.000000
max      23.000000
dtype: float64

In [233]:
mask = marks > 20
marks[mask]

Ahmed    23
Ali      21
Omar     23
Baraa    23
dtype: int64

In [234]:
mask = (marks > 20) | (marks < 15)
marks[mask]

Ahmed      23
Mohamed    13
Ali        21
Omar       23
Baraa      23
dtype: int64

In [235]:
mask = ~(marks > 20)
marks[mask]

Mohamed    13
Wael       18
Yasser     19
Belal      18
Khalid     18
dtype: int64

In [236]:
marks.head()

Ahmed      23
Mohamed    13
Ali        21
Wael       18
Yasser     19
dtype: int64

In [237]:
marks.tail()

Yasser    19
Omar      23
Belal     18
Khalid    18
Baraa     23
dtype: int64

In [238]:
marks

Ahmed      23
Mohamed    13
Ali        21
Wael       18
Yasser     19
Omar       23
Belal      18
Khalid     18
Baraa      23
dtype: int64

In [239]:
marks.iloc[2]

21

### DataFrame

In [240]:
data = pd.read_csv("week2/day2/sales.csv")
data

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
0,714466,Trantow-Barrows,Craig Booker,Debra Henley,CPU,1,30000,presented
1,714466,Trantow-Barrows,Craig Booker,Debra Henley,Software,1,10000,presented
2,714466,Trantow-Barrows,Craig Booker,Debra Henley,Maintenance,2,5000,pending
3,737550,"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,CPU,1,35000,declined
4,146832,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000,won
5,218895,Kulas Inc,Daniel Hilton,Debra Henley,CPU,2,40000,pending
6,218895,Kulas Inc,Daniel Hilton,Debra Henley,Software,1,10000,presented
7,412290,Jerde-Hilpert,John Smith,Debra Henley,Maintenance,2,5000,pending
8,740150,Barton LLC,John Smith,Debra Henley,CPU,1,35000,declined
9,141962,Herman LLC,Cedric Moss,Fred Anderson,CPU,2,65000,won
10,163416,Purdy-Kunde,Cedric Moss,Fred Anderson,CPU,1,30000,presented
11,239344,Stokes LLC,Cedric Moss,Fred Anderson,Maintenance,1,5000,pending
12,239344,Stokes LLC,Cedric Moss,Fred Anderson,Software,1,10000,presented
13,307599,"Kassulke, Ondricka and Metz",Wendy Yule,Fred Anderson,Maintenance,3,7000,won
14,688981,Keeling LLC,Wendy Yule,Fred Anderson,CPU,5,100000,won
15,729833,Koepp Ltd,Wendy Yule,Fred Anderson,CPU,2,65000,declined
16,729833,Koepp Ltd,Wendy Yule,Fred Anderson,Monitor,2,5000,presented
17,123456,cosmos,neil,lucy,universe,1,"1,000,000",presented

In [241]:
data["Name"]

0                  Trantow-Barrows
1                  Trantow-Barrows
2                  Trantow-Barrows
3     Fritsch, Russel and Anderson
4                     Kiehn-Spinka
5                        Kulas Inc
6                        Kulas Inc
7                    Jerde-Hilpert
8                       Barton LLC
9                       Herman LLC
10                     Purdy-Kunde
11                      Stokes LLC
12                      Stokes LLC
13     Kassulke, Ondricka and Metz
14                     Keeling LLC
15                       Koepp Ltd
16                       Koepp Ltd
17                          cosmos
Name: Name, dtype: object

In [242]:
data[["Name", "Product", "Quantity", "Price"]]

                            Name      Product  Quantity      Price
0                Trantow-Barrows          CPU         1      30000
1                Trantow-Barrows     Software         1      10000
2                Trantow-Barrows  Maintenance         2       5000
3   Fritsch, Russel and Anderson          CPU         1      35000
4                   Kiehn-Spinka          CPU         2      65000
5                      Kulas Inc          CPU         2      40000
6                      Kulas Inc     Software         1      10000
7                  Jerde-Hilpert  Maintenance         2       5000
8                     Barton LLC          CPU         1      35000
9                     Herman LLC          CPU         2      65000
10                   Purdy-Kunde          CPU         1      30000
11                    Stokes LLC  Maintenance         1       5000
12                    Stokes LLC     Software         1      10000
13   Kassulke, Ondricka and Metz  Maintenance         3       7000
14                   Keeling LLC          CPU         5     100000
15                     Koepp Ltd          CPU         2      65000
16                     Koepp Ltd      Monitor         2       5000
17                        cosmos     universe         1  1,000,000

In [243]:
data[1:5]

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
1,714466,Trantow-Barrows,Craig Booker,Debra Henley,Software,1,10000,presented
2,714466,Trantow-Barrows,Craig Booker,Debra Henley,Maintenance,2,5000,pending
3,737550,"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,CPU,1,35000,declined
4,146832,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000,won

In [244]:
data.loc[1:5, "Name": "Price"]

,Name,Rep,Manager,Product,Quantity,Price
1,Trantow-Barrows,Craig Booker,Debra Henley,Software,1,10000
2,Trantow-Barrows,Craig Booker,Debra Henley,Maintenance,2,5000
3,"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,CPU,1,35000
4,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000
5,Kulas Inc,Daniel Hilton,Debra Henley,CPU,2,40000

In [245]:
data.iloc[1:5, 1:7]

,Name,Rep,Manager,Product,Quantity,Price
1,Trantow-Barrows,Craig Booker,Debra Henley,Software,1,10000
2,Trantow-Barrows,Craig Booker,Debra Henley,Maintenance,2,5000
3,"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,CPU,1,35000
4,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000

In [246]:
data.iloc[:, 1:7]

,Name,Rep,Manager,Product,Quantity,Price
0,Trantow-Barrows,Craig Booker,Debra Henley,CPU,1,30000
1,Trantow-Barrows,Craig Booker,Debra Henley,Software,1,10000
2,Trantow-Barrows,Craig Booker,Debra Henley,Maintenance,2,5000
3,"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,CPU,1,35000
4,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000
5,Kulas Inc,Daniel Hilton,Debra Henley,CPU,2,40000
6,Kulas Inc,Daniel Hilton,Debra Henley,Software,1,10000
7,Jerde-Hilpert,John Smith,Debra Henley,Maintenance,2,5000
8,Barton LLC,John Smith,Debra Henley,CPU,1,35000
9,Herman LLC,Cedric Moss,Fred Anderson,CPU,2,65000
10,Purdy-Kunde,Cedric Moss,Fred Anderson,CPU,1,30000
11,Stokes LLC,Cedric Moss,Fred Anderson,Maintenance,1,5000
12,Stokes LLC,Cedric Moss,Fred Anderson,Software,1,10000
13,"Kassulke, Ondricka and Metz",Wendy Yule,Fred Anderson,Maintenance,3,7000
14,Keeling LLC,Wendy Yule,Fred Anderson,CPU,5,100000
15,Koepp Ltd,Wendy Yule,Fred Anderson,CPU,2,65000
16,Koepp Ltd,Wendy Yule,Fred Anderson,Monitor,2,5000
17,cosmos,neil,lucy,universe,1,"1,000,000"

In [247]:
mask = data["Product"] == "CPU"
data[mask]

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
0,714466,Trantow-Barrows,Craig Booker,Debra Henley,CPU,1,30000,presented
3,737550,"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,CPU,1,35000,declined
4,146832,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000,won
5,218895,Kulas Inc,Daniel Hilton,Debra Henley,CPU,2,40000,pending
8,740150,Barton LLC,John Smith,Debra Henley,CPU,1,35000,declined
9,141962,Herman LLC,Cedric Moss,Fred Anderson,CPU,2,65000,won
10,163416,Purdy-Kunde,Cedric Moss,Fred Anderson,CPU,1,30000,presented
14,688981,Keeling LLC,Wendy Yule,Fred Anderson,CPU,5,100000,won
15,729833,Koepp Ltd,Wendy Yule,Fred Anderson,CPU,2,65000,declined

In [248]:
mask = data["Quantity"] > 3
data[mask]

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
14,688981,Keeling LLC,Wendy Yule,Fred Anderson,CPU,5,100000,won

In [249]:
data.head()

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
0,714466,Trantow-Barrows,Craig Booker,Debra Henley,CPU,1,30000,presented
1,714466,Trantow-Barrows,Craig Booker,Debra Henley,Software,1,10000,presented
2,714466,Trantow-Barrows,Craig Booker,Debra Henley,Maintenance,2,5000,pending
3,737550,"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,CPU,1,35000,declined
4,146832,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000,won

In [250]:
data.tail()

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
13,307599,"Kassulke, Ondricka and Metz",Wendy Yule,Fred Anderson,Maintenance,3,7000,won
14,688981,Keeling LLC,Wendy Yule,Fred Anderson,CPU,5,100000,won
15,729833,Koepp Ltd,Wendy Yule,Fred Anderson,CPU,2,65000,declined
16,729833,Koepp Ltd,Wendy Yule,Fred Anderson,Monitor,2,5000,presented
17,123456,cosmos,neil,lucy,universe,1,"1,000,000",presented

In [251]:
data.describe()

             Account   Quantity
count      18.000000  18.000000
mean   443432.111111   1.722222
std    263737.607563   1.017815
min    123456.000000   1.000000
25%    218895.000000   1.000000
50%    359944.500000   1.500000
75%    714466.000000   2.000000
max    740150.000000   5.000000

In [252]:
data.describe(include="all")

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
count,18.000000,18,18,18,18,18.000000,18,18
unique,NaN,13,6,3,5,NaN,9,4
top,NaN,Trantow-Barrows,Craig Booker,Debra Henley,CPU,NaN,5000,presented
freq,NaN,3,4,9,9,NaN,4,7
mean,443432.111111,NaN,NaN,NaN,NaN,1.722222,NaN,NaN
std,263737.607563,NaN,NaN,NaN,NaN,1.017815,NaN,NaN
min,123456.000000,NaN,NaN,NaN,NaN,1.000000,NaN,NaN
25%,218895.000000,NaN,NaN,NaN,NaN,1.000000,NaN,NaN
50%,359944.500000,NaN,NaN,NaN,NaN,1.500000,NaN,NaN
75%,714466.000000,NaN,NaN,NaN,NaN,2.000000,NaN,NaN
max,740150.000000,NaN,NaN,NaN,NaN,5.000000,NaN,NaN

In [253]:
data["Quantity"].mean()

1.7222222222222223

In [257]:
data[["Name", "Price"]]

                            Name      Price
0                Trantow-Barrows      30000
1                Trantow-Barrows      10000
2                Trantow-Barrows       5000
3   Fritsch, Russel and Anderson      35000
4                   Kiehn-Spinka      65000
5                      Kulas Inc      40000
6                      Kulas Inc      10000
7                  Jerde-Hilpert       5000
8                     Barton LLC      35000
9                     Herman LLC      65000
10                   Purdy-Kunde      30000
11                    Stokes LLC       5000
12                    Stokes LLC      10000
13   Kassulke, Ondricka and Metz       7000
14                   Keeling LLC     100000
15                     Koepp Ltd      65000
16                     Koepp Ltd       5000
17                        cosmos  1,000,000

In [262]:
data.loc[1:5, "Name":"Price"]

,Name,Rep,Manager,Product,Quantity,Price
1,Trantow-Barrows,Craig Booker,Debra Henley,Software,1,10000
2,Trantow-Barrows,Craig Booker,Debra Henley,Maintenance,2,5000
3,"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,CPU,1,35000
4,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000
5,Kulas Inc,Daniel Hilton,Debra Henley,CPU,2,40000

In [265]:
data.iloc[1:5, 1:7]

,Name,Rep,Manager,Product,Quantity,Price
1,Trantow-Barrows,Craig Booker,Debra Henley,Software,1,10000
2,Trantow-Barrows,Craig Booker,Debra Henley,Maintenance,2,5000
3,"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,CPU,1,35000
4,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000

In [266]:
pd.Series([1, 2, 3])

0    1
1    2
2    3
dtype: int64

In [267]:
pd.Series([1, 2, 3.0])

0    1.0
1    2.0
2    3.0
dtype: float64

In [270]:
pd.Series([1, 2, "3.0"])

0      1
1      2
2    3.0
dtype: object

In [271]:
data.describe()

             Account   Quantity
count      18.000000  18.000000
mean   443432.111111   1.722222
std    263737.607563   1.017815
min    123456.000000   1.000000
25%    218895.000000   1.000000
50%    359944.500000   1.500000
75%    714466.000000   2.000000
max    740150.000000   5.000000

In [272]:
data.dtypes

Account      int64
Name        object
Rep         object
Manager     object
Product     object
Quantity     int64
Price       object
Status      object
dtype: object

In [273]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18 entries, 0 to 17
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Account   18 non-null     int64
 1   Name      18 non-null     object
 2   Rep       18 non-null     object
 3   Manager   18 non-null     object
 4   Product   18 non-null     object
 5   Quantity  18 non-null     int64
 6   Price     18 non-null     object
 7   Status    18 non-null     object
dtypes: int64(2), object(6)
memory usage: 1.2+ KB

### Pandas **Apply** function

In [274]:
data = pd.read_csv("week3/day1/coffee-preferences.csv")
data

,Timestamp,Name,Starbucks,PhilzCoffee,BlueBottleCoffee,PeetsTea,CaffeTrieste,GrandCoffee,RitualCoffee,FourBarrel,WorkshopCafe
0,3/17/2015 18:37:58,Alison,3,5,4.0,3.0,NaN,NaN,5.0,5.0,NaN
1,3/17/2015 18:38:09,April,4,5,5.0,3.0,NaN,NaN,3.0,NaN,5.0
2,3/17/2015 18:38:25,Vijay,3,5,5.0,5.0,3.0,2.0,1.0,1.0,1.0
3,3/17/2015 18:38:28,Vanessa,1,5,5.0,2.0,NaN,NaN,3.0,2.0,3.0
4,3/17/2015 18:38:46,Isabel,1,4,4.0,2.0,4.0,NaN,4.0,4.0,NaN
5,3/17/2015 18:39:01,India,5,3,3.0,3.0,3.0,1.0,NaN,NaN,3.0
6,3/17/2015 18:39:01,Dave H,4,5,NaN,5.0,NaN,NaN,NaN,NaN,NaN
7,3/17/2015 18:39:05,Deepthi,3,5,NaN,2.0,NaN,NaN,NaN,NaN,2.0
8,3/17/2015 18:39:14,Ramesh,3,4,NaN,3.0,NaN,NaN,NaN,NaN,4.0
9,3/17/2015 18:39:23,Hugh Jass,1,5,5.0,4.0,5.0,2.0,5.0,4.0,1.0
10,3/17/2015 18:39:23,Alex,4,5,NaN,3.0,NaN,NaN,NaN,NaN,NaN
11,3/17/2015 18:39:30,Ajay Anand,3,4,4.0,3.0,5.0,NaN,NaN,NaN,NaN
12,3/17/2015 18:39:30,Ajay Anand,3,4,4.0,3.0,5.0,NaN,NaN,NaN,NaN
13,3/17/2015 18:39:35,David Feng,2,3,4.0,2.0,2.0,NaN,5.0,4.0,3.0
14,3/17/2015 18:39:42,Zach,3,4,4.0,3.0,NaN,NaN,NaN,NaN,5.0
15,3/17/2015 18:40:44,Matt,3,5,4.0,3.0,2.0,2.0,4.0,3.0,2.0
16,3/17/2015 18:40:49,Markus,3,5,NaN,3.0,NaN,NaN,4.0,NaN,NaN
17,3/17/2015 18:41:18,Otto,4,2,2.0,5.0,NaN,NaN,3.0,3.0,3.0
18,3/17/2015 18:41:23,Alessandro,1,5,3.0,2.0,NaN,NaN,4.0,3.0,NaN
19,3/17/2015 18:41:35,Rocky,3,5,4.0,3.0,3.0,3.0,4.0,4.0,3.0
20,3/17/2015 18:42:01,cheong-tseng eng,3,1,NaN,NaN,NaN,NaN,4.0,NaN,NaN
21,3/17/2015 18:39:01,Dave H,4,5,NaN,5.0,NaN,NaN,NaN,NaN,NaN

In [276]:
data.loc[:, "Starbucks":] * 10 / 5

,Starbucks,PhilzCoffee,BlueBottleCoffee,PeetsTea,CaffeTrieste,GrandCoffee,RitualCoffee,FourBarrel,WorkshopCafe
0,6.0,10.0,8.0,6.0,NaN,NaN,10.0,10.0,NaN
1,8.0,10.0,10.0,6.0,NaN,NaN,6.0,NaN,10.0
2,6.0,10.0,10.0,10.0,6.0,4.0,2.0,2.0,2.0
3,2.0,10.0,10.0,4.0,NaN,NaN,6.0,4.0,6.0
4,2.0,8.0,8.0,4.0,8.0,NaN,8.0,8.0,NaN
5,10.0,6.0,6.0,6.0,6.0,2.0,NaN,NaN,6.0
6,8.0,10.0,NaN,10.0,NaN,NaN,NaN,NaN,NaN
7,6.0,10.0,NaN,4.0,NaN,NaN,NaN,NaN,4.0
8,6.0,8.0,NaN,6.0,NaN,NaN,NaN,NaN,8.0
9,2.0,10.0,10.0,8.0,10.0,4.0,10.0,8.0,2.0
10,8.0,10.0,NaN,6.0,NaN,NaN,NaN,NaN,NaN
11,6.0,8.0,8.0,6.0,10.0,NaN,NaN,NaN,NaN
12,6.0,8.0,8.0,6.0,10.0,NaN,NaN,NaN,NaN
13,4.0,6.0,8.0,4.0,4.0,NaN,10.0,8.0,6.0
14,6.0,8.0,8.0,6.0,NaN,NaN,NaN,NaN,10.0
15,6.0,10.0,8.0,6.0,4.0,4.0,8.0,6.0,4.0
16,6.0,10.0,NaN,6.0,NaN,NaN,8.0,NaN,NaN
17,8.0,4.0,4.0,10.0,NaN,NaN,6.0,6.0,6.0
18,2.0,10.0,6.0,4.0,NaN,NaN,8.0,6.0,NaN
19,6.0,10.0,8.0,6.0,6.0,6.0,8.0,8.0,6.0
20,6.0,2.0,NaN,NaN,NaN,NaN,8.0,NaN,NaN
21,8.0,10.0,NaN,10.0,NaN,NaN,NaN,NaN,NaN

In [277]:
def calc_percentage(value):
    return value * 100 / 5

data.loc[:, "Starbucks":].apply(calc_percentage)

,Starbucks,PhilzCoffee,BlueBottleCoffee,PeetsTea,CaffeTrieste,GrandCoffee,RitualCoffee,FourBarrel,WorkshopCafe
0,60.0,100.0,80.0,60.0,NaN,NaN,100.0,100.0,NaN
1,80.0,100.0,100.0,60.0,NaN,NaN,60.0,NaN,100.0
2,60.0,100.0,100.0,100.0,60.0,40.0,20.0,20.0,20.0
3,20.0,100.0,100.0,40.0,NaN,NaN,60.0,40.0,60.0
4,20.0,80.0,80.0,40.0,80.0,NaN,80.0,80.0,NaN
5,100.0,60.0,60.0,60.0,60.0,20.0,NaN,NaN,60.0
6,80.0,100.0,NaN,100.0,NaN,NaN,NaN,NaN,NaN
7,60.0,100.0,NaN,40.0,NaN,NaN,NaN,NaN,40.0
8,60.0,80.0,NaN,60.0,NaN,NaN,NaN,NaN,80.0
9,20.0,100.0,100.0,80.0,100.0,40.0,100.0,80.0,20.0
10,80.0,100.0,NaN,60.0,NaN,NaN,NaN,NaN,NaN
11,60.0,80.0,80.0,60.0,100.0,NaN,NaN,NaN,NaN
12,60.0,80.0,80.0,60.0,100.0,NaN,NaN,NaN,NaN
13,40.0,60.0,80.0,40.0,40.0,NaN,100.0,80.0,60.0
14,60.0,80.0,80.0,60.0,NaN,NaN,NaN,NaN,100.0
15,60.0,100.0,80.0,60.0,40.0,40.0,80.0,60.0,40.0
16,60.0,100.0,NaN,60.0,NaN,NaN,80.0,NaN,NaN
17,80.0,40.0,40.0,100.0,NaN,NaN,60.0,60.0,60.0
18,20.0,100.0,60.0,40.0,NaN,NaN,80.0,60.0,NaN
19,60.0,100.0,80.0,60.0,60.0,60.0,80.0,80.0,60.0
20,60.0,20.0,NaN,NaN,NaN,NaN,80.0,NaN,NaN
21,80.0,100.0,NaN,100.0,NaN,NaN,NaN,NaN,NaN

In [278]:
data.loc[:, "Starbucks":].apply(np.sum)

Starbucks           64.0
PhilzCoffee         94.0
BlueBottleCoffee    60.0
PeetsTea            67.0
CaffeTrieste        32.0
GrandCoffee         10.0
RitualCoffee        49.0
FourBarrel          33.0
WorkshopCafe        35.0
dtype: float64

In [279]:
data.loc[:, "Starbucks":].apply(np.sum,axis=1)

0     25.0
1     25.0
2     26.0
3     21.0
4     23.0
5     21.0
6     14.0
7     12.0
8     14.0
9     32.0
10    12.0
11    19.0
12    19.0
13    25.0
14    19.0
15    28.0
16    15.0
17    22.0
18    18.0
19    32.0
20     8.0
21    14.0
dtype: float64

### Pandas **value_counts** function

In [280]:
data["Starbucks"].value_counts()

3    11
4     5
1     4
5     1
2     1
Name: Starbucks, dtype: int64

In [282]:
data.dtypes.value_counts()

float64    7
object     2
int64      2
dtype: int64

## Data Cleaning

In [283]:
data = pd.read_csv("week3/day1/coffee-preferences.csv")
data

,Timestamp,Name,Starbucks,PhilzCoffee,BlueBottleCoffee,PeetsTea,CaffeTrieste,GrandCoffee,RitualCoffee,FourBarrel,WorkshopCafe
0,3/17/2015 18:37:58,Alison,3,5,4.0,3.0,NaN,NaN,5.0,5.0,NaN
1,3/17/2015 18:38:09,April,4,5,5.0,3.0,NaN,NaN,3.0,NaN,5.0
2,3/17/2015 18:38:25,Vijay,3,5,5.0,5.0,3.0,2.0,1.0,1.0,1.0
3,3/17/2015 18:38:28,Vanessa,1,5,5.0,2.0,NaN,NaN,3.0,2.0,3.0
4,3/17/2015 18:38:46,Isabel,1,4,4.0,2.0,4.0,NaN,4.0,4.0,NaN
5,3/17/2015 18:39:01,India,5,3,3.0,3.0,3.0,1.0,NaN,NaN,3.0
6,3/17/2015 18:39:01,Dave H,4,5,NaN,5.0,NaN,NaN,NaN,NaN,NaN
7,3/17/2015 18:39:05,Deepthi,3,5,NaN,2.0,NaN,NaN,NaN,NaN,2.0
8,3/17/2015 18:39:14,Ramesh,3,4,NaN,3.0,NaN,NaN,NaN,NaN,4.0
9,3/17/2015 18:39:23,Hugh Jass,1,5,5.0,4.0,5.0,2.0,5.0,4.0,1.0
10,3/17/2015 18:39:23,Alex,4,5,NaN,3.0,NaN,NaN,NaN,NaN,NaN
11,3/17/2015 18:39:30,Ajay Anand,3,4,4.0,3.0,5.0,NaN,NaN,NaN,NaN
12,3/17/2015 18:39:30,Ajay Anand,3,4,4.0,3.0,5.0,NaN,NaN,NaN,NaN
13,3/17/2015 18:39:35,David Feng,2,3,4.0,2.0,2.0,NaN,5.0,4.0,3.0
14,3/17/2015 18:39:42,Zach,3,4,4.0,3.0,NaN,NaN,NaN,NaN,5.0
15,3/17/2015 18:40:44,Matt,3,5,4.0,3.0,2.0,2.0,4.0,3.0,2.0
16,3/17/2015 18:40:49,Markus,3,5,NaN,3.0,NaN,NaN,4.0,NaN,NaN
17,3/17/2015 18:41:18,Otto,4,2,2.0,5.0,NaN,NaN,3.0,3.0,3.0
18,3/17/2015 18:41:23,Alessandro,1,5,3.0,2.0,NaN,NaN,4.0,3.0,NaN
19,3/17/2015 18:41:35,Rocky,3,5,4.0,3.0,3.0,3.0,4.0,4.0,3.0
20,3/17/2015 18:42:01,cheong-tseng eng,3,1,NaN,NaN,NaN,NaN,4.0,NaN,NaN
21,3/17/2015 18:39:01,Dave H,4,5,NaN,5.0,NaN,NaN,NaN,NaN,NaN

In [286]:
mask = data["BlueBottleCoffee"].isnull()
data[mask]

,Timestamp,Name,Starbucks,PhilzCoffee,BlueBottleCoffee,PeetsTea,CaffeTrieste,GrandCoffee,RitualCoffee,FourBarrel,WorkshopCafe
6,3/17/2015 18:39:01,Dave H,4,5,NaN,5.0,NaN,NaN,NaN,NaN,NaN
7,3/17/2015 18:39:05,Deepthi,3,5,NaN,2.0,NaN,NaN,NaN,NaN,2.0
8,3/17/2015 18:39:14,Ramesh,3,4,NaN,3.0,NaN,NaN,NaN,NaN,4.0
10,3/17/2015 18:39:23,Alex,4,5,NaN,3.0,NaN,NaN,NaN,NaN,NaN
16,3/17/2015 18:40:49,Markus,3,5,NaN,3.0,NaN,NaN,4.0,NaN,NaN
20,3/17/2015 18:42:01,cheong-tseng eng,3,1,NaN,NaN,NaN,NaN,4.0,NaN,NaN
21,3/17/2015 18:39:01,Dave H,4,5,NaN,5.0,NaN,NaN,NaN,NaN,NaN

In [288]:
data["BlueBottleCoffee"].isnull().sum()

7

In [289]:
data["BlueBottleCoffee"].notnull().sum()

15

In [290]:
mask = data["BlueBottleCoffee"].notnull()
data[mask]

,Timestamp,Name,Starbucks,PhilzCoffee,BlueBottleCoffee,PeetsTea,CaffeTrieste,GrandCoffee,RitualCoffee,FourBarrel,WorkshopCafe
0,3/17/2015 18:37:58,Alison,3,5,4.0,3.0,NaN,NaN,5.0,5.0,NaN
1,3/17/2015 18:38:09,April,4,5,5.0,3.0,NaN,NaN,3.0,NaN,5.0
2,3/17/2015 18:38:25,Vijay,3,5,5.0,5.0,3.0,2.0,1.0,1.0,1.0
3,3/17/2015 18:38:28,Vanessa,1,5,5.0,2.0,NaN,NaN,3.0,2.0,3.0
4,3/17/2015 18:38:46,Isabel,1,4,4.0,2.0,4.0,NaN,4.0,4.0,NaN
5,3/17/2015 18:39:01,India,5,3,3.0,3.0,3.0,1.0,NaN,NaN,3.0
9,3/17/2015 18:39:23,Hugh Jass,1,5,5.0,4.0,5.0,2.0,5.0,4.0,1.0
11,3/17/2015 18:39:30,Ajay Anand,3,4,4.0,3.0,5.0,NaN,NaN,NaN,NaN
12,3/17/2015 18:39:30,Ajay Anand,3,4,4.0,3.0,5.0,NaN,NaN,NaN,NaN
13,3/17/2015 18:39:35,David Feng,2,3,4.0,2.0,2.0,NaN,5.0,4.0,3.0
14,3/17/2015 18:39:42,Zach,3,4,4.0,3.0,NaN,NaN,NaN,NaN,5.0
15,3/17/2015 18:40:44,Matt,3,5,4.0,3.0,2.0,2.0,4.0,3.0,2.0
17,3/17/2015 18:41:18,Otto,4,2,2.0,5.0,NaN,NaN,3.0,3.0,3.0
18,3/17/2015 18:41:23,Alessandro,1,5,3.0,2.0,NaN,NaN,4.0,3.0,NaN
19,3/17/2015 18:41:35,Rocky,3,5,4.0,3.0,3.0,3.0,4.0,4.0,3.0

In [291]:
data["BlueBottleCoffee"].dropna()

0     4.0
1     5.0
2     5.0
3     5.0
4     4.0
5     3.0
9     5.0
11    4.0
12    4.0
13    4.0
14    4.0
15    4.0
17    2.0
18    3.0
19    4.0
Name: BlueBottleCoffee, dtype: float64

In [292]:
data["BlueBottleCoffee"]

0     4.0
1     5.0
2     5.0
3     5.0
4     4.0
5     3.0
6     NaN
7     NaN
8     NaN
9     5.0
10    NaN
11    4.0
12    4.0
13    4.0
14    4.0
15    4.0
16    NaN
17    2.0
18    3.0
19    4.0
20    NaN
21    NaN
Name: BlueBottleCoffee, dtype: float64

In [295]:
col = data["BlueBottleCoffee"]
col

0     4.0
1     5.0
2     5.0
3     5.0
4     4.0
5     3.0
6     NaN
7     NaN
8     NaN
9     5.0
10    NaN
11    4.0
12    4.0
13    4.0
14    4.0
15    4.0
16    NaN
17    2.0
18    3.0
19    4.0
20    NaN
21    NaN
Name: BlueBottleCoffee, dtype: float64

In [296]:
col.dropna(inplace=True)

In [297]:
col

0     4.0
1     5.0
2     5.0
3     5.0
4     4.0
5     3.0
9     5.0
11    4.0
12    4.0
13    4.0
14    4.0
15    4.0
17    2.0
18    3.0
19    4.0
Name: BlueBottleCoffee, dtype: float64

In [299]:
data.dropna()

,Timestamp,Name,Starbucks,PhilzCoffee,BlueBottleCoffee,PeetsTea,CaffeTrieste,GrandCoffee,RitualCoffee,FourBarrel,WorkshopCafe
2,3/17/2015 18:38:25,Vijay,3,5,5.0,5.0,3.0,2.0,1.0,1.0,1.0
9,3/17/2015 18:39:23,Hugh Jass,1,5,5.0,4.0,5.0,2.0,5.0,4.0,1.0
15,3/17/2015 18:40:44,Matt,3,5,4.0,3.0,2.0,2.0,4.0,3.0,2.0
19,3/17/2015 18:41:35,Rocky,3,5,4.0,3.0,3.0,3.0,4.0,4.0,3.0

In [301]:
data.dropna(axis=1)

             Timestamp              Name  Starbucks  PhilzCoffee
0   3/17/2015 18:37:58            Alison          3            5
1   3/17/2015 18:38:09             April          4            5
2   3/17/2015 18:38:25             Vijay          3            5
3   3/17/2015 18:38:28           Vanessa          1            5
4   3/17/2015 18:38:46            Isabel          1            4
5   3/17/2015 18:39:01             India          5            3
6   3/17/2015 18:39:01            Dave H          4            5
7   3/17/2015 18:39:05           Deepthi          3            5
8   3/17/2015 18:39:14            Ramesh          3            4
9   3/17/2015 18:39:23         Hugh Jass          1            5
10  3/17/2015 18:39:23              Alex          4            5
11  3/17/2015 18:39:30        Ajay Anand          3            4
12  3/17/2015 18:39:30        Ajay Anand          3            4
13  3/17/2015 18:39:35        David Feng          2            3
14  3/17/2015 18:39:42              Zach          3            4
15  3/17/2015 18:40:44              Matt          3            5
16  3/17/2015 18:40:49            Markus          3            5
17  3/17/2015 18:41:18              Otto          4            2
18  3/17/2015 18:41:23        Alessandro          1            5
19  3/17/2015 18:41:35             Rocky          3            5
20  3/17/2015 18:42:01  cheong-tseng eng          3            1
21  3/17/2015 18:39:01            Dave H          4            5

In [304]:
data.dropna(thresh=8)

,Timestamp,Name,Starbucks,PhilzCoffee,BlueBottleCoffee,PeetsTea,CaffeTrieste,GrandCoffee,RitualCoffee,FourBarrel,WorkshopCafe
0,3/17/2015 18:37:58,Alison,3,5,4.0,3.0,NaN,NaN,5.0,5.0,NaN
1,3/17/2015 18:38:09,April,4,5,5.0,3.0,NaN,NaN,3.0,NaN,5.0
2,3/17/2015 18:38:25,Vijay,3,5,5.0,5.0,3.0,2.0,1.0,1.0,1.0
3,3/17/2015 18:38:28,Vanessa,1,5,5.0,2.0,NaN,NaN,3.0,2.0,3.0
4,3/17/2015 18:38:46,Isabel,1,4,4.0,2.0,4.0,NaN,4.0,4.0,NaN
5,3/17/2015 18:39:01,India,5,3,3.0,3.0,3.0,1.0,NaN,NaN,3.0
9,3/17/2015 18:39:23,Hugh Jass,1,5,5.0,4.0,5.0,2.0,5.0,4.0,1.0
13,3/17/2015 18:39:35,David Feng,2,3,4.0,2.0,2.0,NaN,5.0,4.0,3.0
15,3/17/2015 18:40:44,Matt,3,5,4.0,3.0,2.0,2.0,4.0,3.0,2.0
17,3/17/2015 18:41:18,Otto,4,2,2.0,5.0,NaN,NaN,3.0,3.0,3.0
18,3/17/2015 18:41:23,Alessandro,1,5,3.0,2.0,NaN,NaN,4.0,3.0,NaN
19,3/17/2015 18:41:35,Rocky,3,5,4.0,3.0,3.0,3.0,4.0,4.0,3.0

In [306]:
data.dropna(axis=1, thresh=18)

             Timestamp              Name  Starbucks  PhilzCoffee  PeetsTea
0   3/17/2015 18:37:58            Alison          3            5       3.0
1   3/17/2015 18:38:09             April          4            5       3.0
2   3/17/2015 18:38:25             Vijay          3            5       5.0
3   3/17/2015 18:38:28           Vanessa          1            5       2.0
4   3/17/2015 18:38:46            Isabel          1            4       2.0
5   3/17/2015 18:39:01             India          5            3       3.0
6   3/17/2015 18:39:01            Dave H          4            5       5.0
7   3/17/2015 18:39:05           Deepthi          3            5       2.0
8   3/17/2015 18:39:14            Ramesh          3            4       3.0
9   3/17/2015 18:39:23         Hugh Jass          1            5       4.0
10  3/17/2015 18:39:23              Alex          4            5       3.0
11  3/17/2015 18:39:30        Ajay Anand          3            4       3.0
12  3/17/2015 18:39:30        Ajay Anand          3            4       3.0
13  3/17/2015 18:39:35        David Feng          2            3       2.0
14  3/17/2015 18:39:42              Zach          3            4       3.0
15  3/17/2015 18:40:44              Matt          3            5       3.0
16  3/17/2015 18:40:49            Markus          3            5       3.0
17  3/17/2015 18:41:18              Otto          4            2       5.0
18  3/17/2015 18:41:23        Alessandro          1            5       2.0
19  3/17/2015 18:41:35             Rocky          3            5       3.0
20  3/17/2015 18:42:01  cheong-tseng eng          3            1       NaN
21  3/17/2015 18:39:01            Dave H          4            5       5.0

In [309]:
data.dropna(subset=["PeetsTea", "RitualCoffee"])

,Timestamp,Name,Starbucks,PhilzCoffee,BlueBottleCoffee,PeetsTea,CaffeTrieste,GrandCoffee,RitualCoffee,FourBarrel,WorkshopCafe
0,3/17/2015 18:37:58,Alison,3,5,4.0,3.0,NaN,NaN,5.0,5.0,NaN
1,3/17/2015 18:38:09,April,4,5,5.0,3.0,NaN,NaN,3.0,NaN,5.0
2,3/17/2015 18:38:25,Vijay,3,5,5.0,5.0,3.0,2.0,1.0,1.0,1.0
3,3/17/2015 18:38:28,Vanessa,1,5,5.0,2.0,NaN,NaN,3.0,2.0,3.0
4,3/17/2015 18:38:46,Isabel,1,4,4.0,2.0,4.0,NaN,4.0,4.0,NaN
9,3/17/2015 18:39:23,Hugh Jass,1,5,5.0,4.0,5.0,2.0,5.0,4.0,1.0
13,3/17/2015 18:39:35,David Feng,2,3,4.0,2.0,2.0,NaN,5.0,4.0,3.0
15,3/17/2015 18:40:44,Matt,3,5,4.0,3.0,2.0,2.0,4.0,3.0,2.0
16,3/17/2015 18:40:49,Markus,3,5,NaN,3.0,NaN,NaN,4.0,NaN,NaN
17,3/17/2015 18:41:18,Otto,4,2,2.0,5.0,NaN,NaN,3.0,3.0,3.0
18,3/17/2015 18:41:23,Alessandro,1,5,3.0,2.0,NaN,NaN,4.0,3.0,NaN
19,3/17/2015 18:41:35,Rocky,3,5,4.0,3.0,3.0,3.0,4.0,4.0,3.0

In [312]:
data.fillna(0)

,Timestamp,Name,Starbucks,PhilzCoffee,BlueBottleCoffee,PeetsTea,CaffeTrieste,GrandCoffee,RitualCoffee,FourBarrel,WorkshopCafe
0,3/17/2015 18:37:58,Alison,3,5,4.0,3.0,0.0,0.0,5.0,5.0,0.0
1,3/17/2015 18:38:09,April,4,5,5.0,3.0,0.0,0.0,3.0,0.0,5.0
2,3/17/2015 18:38:25,Vijay,3,5,5.0,5.0,3.0,2.0,1.0,1.0,1.0
3,3/17/2015 18:38:28,Vanessa,1,5,5.0,2.0,0.0,0.0,3.0,2.0,3.0
4,3/17/2015 18:38:46,Isabel,1,4,4.0,2.0,4.0,0.0,4.0,4.0,0.0
5,3/17/2015 18:39:01,India,5,3,3.0,3.0,3.0,1.0,0.0,0.0,3.0
6,3/17/2015 18:39:01,Dave H,4,5,0.0,5.0,0.0,0.0,0.0,0.0,0.0
7,3/17/2015 18:39:05,Deepthi,3,5,0.0,2.0,0.0,0.0,0.0,0.0,2.0
8,3/17/2015 18:39:14,Ramesh,3,4,0.0,3.0,0.0,0.0,0.0,0.0,4.0
9,3/17/2015 18:39:23,Hugh Jass,1,5,5.0,4.0,5.0,2.0,5.0,4.0,1.0
10,3/17/2015 18:39:23,Alex,4,5,0.0,3.0,0.0,0.0,0.0,0.0,0.0
11,3/17/2015 18:39:30,Ajay Anand,3,4,4.0,3.0,5.0,0.0,0.0,0.0,0.0
12,3/17/2015 18:39:30,Ajay Anand,3,4,4.0,3.0,5.0,0.0,0.0,0.0,0.0
13,3/17/2015 18:39:35,David Feng,2,3,4.0,2.0,2.0,0.0,5.0,4.0,3.0
14,3/17/2015 18:39:42,Zach,3,4,4.0,3.0,0.0,0.0,0.0,0.0,5.0
15,3/17/2015 18:40:44,Matt,3,5,4.0,3.0,2.0,2.0,4.0,3.0,2.0
16,3/17/2015 18:40:49,Markus,3,5,0.0,3.0,0.0,0.0,4.0,0.0,0.0
17,3/17/2015 18:41:18,Otto,4,2,2.0,5.0,0.0,0.0,3.0,3.0,3.0
18,3/17/2015 18:41:23,Alessandro,1,5,3.0,2.0,0.0,0.0,4.0,3.0,0.0
19,3/17/2015 18:41:35,Rocky,3,5,4.0,3.0,3.0,3.0,4.0,4.0,3.0
20,3/17/2015 18:42:01,cheong-tseng eng,3,1,0.0,0.0,0.0,0.0,4.0,0.0,0.0
21,3/17/2015 18:39:01,Dave H,4,5,0.0,5.0,0.0,0.0,0.0,0.0,0.0

In [313]:
data.fillna({"BlueBottleCoffee": -1, "PeetsTea": -2})

,Timestamp,Name,Starbucks,PhilzCoffee,BlueBottleCoffee,PeetsTea,CaffeTrieste,GrandCoffee,RitualCoffee,FourBarrel,WorkshopCafe
0,3/17/2015 18:37:58,Alison,3,5,4.0,3.0,NaN,NaN,5.0,5.0,NaN
1,3/17/2015 18:38:09,April,4,5,5.0,3.0,NaN,NaN,3.0,NaN,5.0
2,3/17/2015 18:38:25,Vijay,3,5,5.0,5.0,3.0,2.0,1.0,1.0,1.0
3,3/17/2015 18:38:28,Vanessa,1,5,5.0,2.0,NaN,NaN,3.0,2.0,3.0
4,3/17/2015 18:38:46,Isabel,1,4,4.0,2.0,4.0,NaN,4.0,4.0,NaN
5,3/17/2015 18:39:01,India,5,3,3.0,3.0,3.0,1.0,NaN,NaN,3.0
6,3/17/2015 18:39:01,Dave H,4,5,-1.0,5.0,NaN,NaN,NaN,NaN,NaN
7,3/17/2015 18:39:05,Deepthi,3,5,-1.0,2.0,NaN,NaN,NaN,NaN,2.0
8,3/17/2015 18:39:14,Ramesh,3,4,-1.0,3.0,NaN,NaN,NaN,NaN,4.0
9,3/17/2015 18:39:23,Hugh Jass,1,5,5.0,4.0,5.0,2.0,5.0,4.0,1.0
10,3/17/2015 18:39:23,Alex,4,5,-1.0,3.0,NaN,NaN,NaN,NaN,NaN
11,3/17/2015 18:39:30,Ajay Anand,3,4,4.0,3.0,5.0,NaN,NaN,NaN,NaN
12,3/17/2015 18:39:30,Ajay Anand,3,4,4.0,3.0,5.0,NaN,NaN,NaN,NaN
13,3/17/2015 18:39:35,David Feng,2,3,4.0,2.0,2.0,NaN,5.0,4.0,3.0
14,3/17/2015 18:39:42,Zach,3,4,4.0,3.0,NaN,NaN,NaN,NaN,5.0
15,3/17/2015 18:40:44,Matt,3,5,4.0,3.0,2.0,2.0,4.0,3.0,2.0
16,3/17/2015 18:40:49,Markus,3,5,-1.0,3.0,NaN,NaN,4.0,NaN,NaN
17,3/17/2015 18:41:18,Otto,4,2,2.0,5.0,NaN,NaN,3.0,3.0,3.0
18,3/17/2015 18:41:23,Alessandro,1,5,3.0,2.0,NaN,NaN,4.0,3.0,NaN
19,3/17/2015 18:41:35,Rocky,3,5,4.0,3.0,3.0,3.0,4.0,4.0,3.0
20,3/17/2015 18:42:01,cheong-tseng eng,3,1,-1.0,-2.0,NaN,NaN,4.0,NaN,NaN
21,3/17/2015 18:39:01,Dave H,4,5,-1.0,5.0,NaN,NaN,NaN,NaN,NaN

In [315]:
data.fillna(data.mean())

,Timestamp,Name,Starbucks,PhilzCoffee,BlueBottleCoffee,PeetsTea,CaffeTrieste,GrandCoffee,RitualCoffee,FourBarrel,WorkshopCafe
0,3/17/2015 18:37:58,Alison,3,5,4.0,3.000000,3.555556,2.0,5.000000,5.0,2.916667
1,3/17/2015 18:38:09,April,4,5,5.0,3.000000,3.555556,2.0,3.000000,3.3,5.000000
2,3/17/2015 18:38:25,Vijay,3,5,5.0,5.000000,3.000000,2.0,1.000000,1.0,1.000000
3,3/17/2015 18:38:28,Vanessa,1,5,5.0,2.000000,3.555556,2.0,3.000000,2.0,3.000000
4,3/17/2015 18:38:46,Isabel,1,4,4.0,2.000000,4.000000,2.0,4.000000,4.0,2.916667
5,3/17/2015 18:39:01,India,5,3,3.0,3.000000,3.000000,1.0,3.769231,3.3,3.000000
6,3/17/2015 18:39:01,Dave H,4,5,4.0,5.000000,3.555556,2.0,3.769231,3.3,2.916667
7,3/17/2015 18:39:05,Deepthi,3,5,4.0,2.000000,3.555556,2.0,3.769231,3.3,2.000000
8,3/17/2015 18:39:14,Ramesh,3,4,4.0,3.000000,3.555556,2.0,3.769231,3.3,4.000000
9,3/17/2015 18:39:23,Hugh Jass,1,5,5.0,4.000000,5.000000,2.0,5.000000,4.0,1.000000
10,3/17/2015 18:39:23,Alex,4,5,4.0,3.000000,3.555556,2.0,3.769231,3.3,2.916667
11,3/17/2015 18:39:30,Ajay Anand,3,4,4.0,3.000000,5.000000,2.0,3.769231,3.3,2.916667
12,3/17/2015 18:39:30,Ajay Anand,3,4,4.0,3.000000,5.000000,2.0,3.769231,3.3,2.916667
13,3/17/2015 18:39:35,David Feng,2,3,4.0,2.000000,2.000000,2.0,5.000000,4.0,3.000000
14,3/17/2015 18:39:42,Zach,3,4,4.0,3.000000,3.555556,2.0,3.769231,3.3,5.000000
15,3/17/2015 18:40:44,Matt,3,5,4.0,3.000000,2.000000,2.0,4.000000,3.0,2.000000
16,3/17/2015 18:40:49,Markus,3,5,4.0,3.000000,3.555556,2.0,4.000000,3.3,2.916667
17,3/17/2015 18:41:18,Otto,4,2,2.0,5.000000,3.555556,2.0,3.000000,3.0,3.000000
18,3/17/2015 18:41:23,Alessandro,1,5,3.0,2.000000,3.555556,2.0,4.000000,3.0,2.916667
19,3/17/2015 18:41:35,Rocky,3,5,4.0,3.000000,3.000000,3.0,4.000000,4.0,3.000000
20,3/17/2015 18:42:01,cheong-tseng eng,3,1,4.0,3.190476,3.555556,2.0,4.000000,3.3,2.916667
21,3/17/2015 18:39:01,Dave H,4,5,4.0,5.000000,3.555556,2.0,3.769231,3.3,2.916667

In [316]:
data.mean()

Starbucks           2.909091
PhilzCoffee         4.272727
BlueBottleCoffee    4.000000
PeetsTea            3.190476
CaffeTrieste        3.555556
GrandCoffee         2.000000
RitualCoffee        3.769231
FourBarrel          3.300000
WorkshopCafe        2.916667
dtype: float64

In [318]:
data.fillna(method="bfill")

,Timestamp,Name,Starbucks,PhilzCoffee,BlueBottleCoffee,PeetsTea,CaffeTrieste,GrandCoffee,RitualCoffee,FourBarrel,WorkshopCafe
0,3/17/2015 18:37:58,Alison,3,5,4.0,3.0,3.0,2.0,5.0,5.0,5.0
1,3/17/2015 18:38:09,April,4,5,5.0,3.0,3.0,2.0,3.0,1.0,5.0
2,3/17/2015 18:38:25,Vijay,3,5,5.0,5.0,3.0,2.0,1.0,1.0,1.0
3,3/17/2015 18:38:28,Vanessa,1,5,5.0,2.0,4.0,1.0,3.0,2.0,3.0
4,3/17/2015 18:38:46,Isabel,1,4,4.0,2.0,4.0,1.0,4.0,4.0,3.0
5,3/17/2015 18:39:01,India,5,3,3.0,3.0,3.0,1.0,5.0,4.0,3.0
6,3/17/2015 18:39:01,Dave H,4,5,5.0,5.0,5.0,2.0,5.0,4.0,2.0
7,3/17/2015 18:39:05,Deepthi,3,5,5.0,2.0,5.0,2.0,5.0,4.0,2.0
8,3/17/2015 18:39:14,Ramesh,3,4,5.0,3.0,5.0,2.0,5.0,4.0,4.0
9,3/17/2015 18:39:23,Hugh Jass,1,5,5.0,4.0,5.0,2.0,5.0,4.0,1.0
10,3/17/2015 18:39:23,Alex,4,5,4.0,3.0,5.0,2.0,5.0,4.0,3.0
11,3/17/2015 18:39:30,Ajay Anand,3,4,4.0,3.0,5.0,2.0,5.0,4.0,3.0
12,3/17/2015 18:39:30,Ajay Anand,3,4,4.0,3.0,5.0,2.0,5.0,4.0,3.0
13,3/17/2015 18:39:35,David Feng,2,3,4.0,2.0,2.0,2.0,5.0,4.0,3.0
14,3/17/2015 18:39:42,Zach,3,4,4.0,3.0,2.0,2.0,4.0,3.0,5.0
15,3/17/2015 18:40:44,Matt,3,5,4.0,3.0,2.0,2.0,4.0,3.0,2.0
16,3/17/2015 18:40:49,Markus,3,5,2.0,3.0,3.0,3.0,4.0,3.0,3.0
17,3/17/2015 18:41:18,Otto,4,2,2.0,5.0,3.0,3.0,3.0,3.0,3.0
18,3/17/2015 18:41:23,Alessandro,1,5,3.0,2.0,3.0,3.0,4.0,3.0,3.0
19,3/17/2015 18:41:35,Rocky,3,5,4.0,3.0,3.0,3.0,4.0,4.0,3.0
20,3/17/2015 18:42:01,cheong-tseng eng,3,1,NaN,5.0,NaN,NaN,4.0,NaN,NaN
21,3/17/2015 18:39:01,Dave H,4,5,NaN,5.0,NaN,NaN,NaN,NaN,NaN

In [323]:
data.fillna(method="ffill")

,Timestamp,Name,Starbucks,PhilzCoffee,BlueBottleCoffee,PeetsTea,CaffeTrieste,GrandCoffee,RitualCoffee,FourBarrel,WorkshopCafe
0,3/17/2015 18:37:58,Alison,3,5,4.0,3.0,NaN,NaN,5.0,5.0,NaN
1,3/17/2015 18:38:09,April,4,5,5.0,3.0,NaN,NaN,3.0,5.0,5.0
2,3/17/2015 18:38:25,Vijay,3,5,5.0,5.0,3.0,2.0,1.0,1.0,1.0
3,3/17/2015 18:38:28,Vanessa,1,5,5.0,2.0,3.0,2.0,3.0,2.0,3.0
4,3/17/2015 18:38:46,Isabel,1,4,4.0,2.0,4.0,2.0,4.0,4.0,3.0
5,3/17/2015 18:39:01,India,5,3,3.0,3.0,3.0,1.0,4.0,4.0,3.0
6,3/17/2015 18:39:01,Dave H,4,5,3.0,5.0,3.0,1.0,4.0,4.0,3.0
7,3/17/2015 18:39:05,Deepthi,3,5,3.0,2.0,3.0,1.0,4.0,4.0,2.0
8,3/17/2015 18:39:14,Ramesh,3,4,3.0,3.0,3.0,1.0,4.0,4.0,4.0
9,3/17/2015 18:39:23,Hugh Jass,1,5,5.0,4.0,5.0,2.0,5.0,4.0,1.0
10,3/17/2015 18:39:23,Alex,4,5,5.0,3.0,5.0,2.0,5.0,4.0,1.0
11,3/17/2015 18:39:30,Ajay Anand,3,4,4.0,3.0,5.0,2.0,5.0,4.0,1.0
12,3/17/2015 18:39:30,Ajay Anand,3,4,4.0,3.0,5.0,2.0,5.0,4.0,1.0
13,3/17/2015 18:39:35,David Feng,2,3,4.0,2.0,2.0,2.0,5.0,4.0,3.0
14,3/17/2015 18:39:42,Zach,3,4,4.0,3.0,2.0,2.0,5.0,4.0,5.0
15,3/17/2015 18:40:44,Matt,3,5,4.0,3.0,2.0,2.0,4.0,3.0,2.0
16,3/17/2015 18:40:49,Markus,3,5,4.0,3.0,2.0,2.0,4.0,3.0,2.0
17,3/17/2015 18:41:18,Otto,4,2,2.0,5.0,2.0,2.0,3.0,3.0,3.0
18,3/17/2015 18:41:23,Alessandro,1,5,3.0,2.0,2.0,2.0,4.0,3.0,3.0
19,3/17/2015 18:41:35,Rocky,3,5,4.0,3.0,3.0,3.0,4.0,4.0,3.0
20,3/17/2015 18:42:01,cheong-tseng eng,3,1,4.0,3.0,3.0,3.0,4.0,4.0,3.0
21,3/17/2015 18:39:01,Dave H,4,5,4.0,5.0,3.0,3.0,4.0,4.0,3.0

In [324]:
data.fillna(method="ffill", limit=2)

,Timestamp,Name,Starbucks,PhilzCoffee,BlueBottleCoffee,PeetsTea,CaffeTrieste,GrandCoffee,RitualCoffee,FourBarrel,WorkshopCafe
0,3/17/2015 18:37:58,Alison,3,5,4.0,3.0,NaN,NaN,5.0,5.0,NaN
1,3/17/2015 18:38:09,April,4,5,5.0,3.0,NaN,NaN,3.0,5.0,5.0
2,3/17/2015 18:38:25,Vijay,3,5,5.0,5.0,3.0,2.0,1.0,1.0,1.0
3,3/17/2015 18:38:28,Vanessa,1,5,5.0,2.0,3.0,2.0,3.0,2.0,3.0
4,3/17/2015 18:38:46,Isabel,1,4,4.0,2.0,4.0,2.0,4.0,4.0,3.0
5,3/17/2015 18:39:01,India,5,3,3.0,3.0,3.0,1.0,4.0,4.0,3.0
6,3/17/2015 18:39:01,Dave H,4,5,3.0,5.0,3.0,1.0,4.0,4.0,3.0
7,3/17/2015 18:39:05,Deepthi,3,5,3.0,2.0,3.0,1.0,NaN,NaN,2.0
8,3/17/2015 18:39:14,Ramesh,3,4,NaN,3.0,NaN,NaN,NaN,NaN,4.0
9,3/17/2015 18:39:23,Hugh Jass,1,5,5.0,4.0,5.0,2.0,5.0,4.0,1.0
10,3/17/2015 18:39:23,Alex,4,5,5.0,3.0,5.0,2.0,5.0,4.0,1.0
11,3/17/2015 18:39:30,Ajay Anand,3,4,4.0,3.0,5.0,2.0,5.0,4.0,1.0
12,3/17/2015 18:39:30,Ajay Anand,3,4,4.0,3.0,5.0,NaN,NaN,NaN,NaN
13,3/17/2015 18:39:35,David Feng,2,3,4.0,2.0,2.0,NaN,5.0,4.0,3.0
14,3/17/2015 18:39:42,Zach,3,4,4.0,3.0,2.0,NaN,5.0,4.0,5.0
15,3/17/2015 18:40:44,Matt,3,5,4.0,3.0,2.0,2.0,4.0,3.0,2.0
16,3/17/2015 18:40:49,Markus,3,5,4.0,3.0,2.0,2.0,4.0,3.0,2.0
17,3/17/2015 18:41:18,Otto,4,2,2.0,5.0,2.0,2.0,3.0,3.0,3.0
18,3/17/2015 18:41:23,Alessandro,1,5,3.0,2.0,NaN,NaN,4.0,3.0,3.0
19,3/17/2015 18:41:35,Rocky,3,5,4.0,3.0,3.0,3.0,4.0,4.0,3.0
20,3/17/2015 18:42:01,cheong-tseng eng,3,1,4.0,3.0,3.0,3.0,4.0,4.0,3.0
21,3/17/2015 18:39:01,Dave H,4,5,4.0,5.0,3.0,3.0,4.0,4.0,3.0